[
  {
    "title": "Description",
    "content": "</br><p>This snap-on fuzzy iPhone case is covered with premium hardwearing vegan Italian Alcantara. The colour is a very dark grey. The Fuzzy iPhone Cover snaps softly onto your iPhone 14. <strong>The RAISED BEZEL EDGE</strong> protects the screen when lying face down. In the bottom corner you'll notice a discreet logo. Inside is covered with the same alcantara. You'll never need to take it off, even when you’re <strong>CHARGING WIRELESSLY VIA MAGSAFE</strong>.</p></br></br> <h2>WHAT SETS IT APART</h2> </br> <p>Made in Italy Alcantara - It's hardwearing, durable, VEGAN and easy to maintain but it's suede-like soft surface adds a real touch of luxury... and hey, if it's good enough for a Lamborghini car interior, it's guaranteed to be the right match for your iPhone case. The <strong>SPACES AROUND THE SPEAKER</strong> and charging port are left open for unrestricted access without compromising on protection</p></br>"
  },
  {
    "title": "Worldwide Shipping",
    "content": "</br><p>Orders ship in 1-3 working days. This does not apply to products on pre-order with an estimated ship date.</p></br> <p>UK- £7.99 - £9.99</p> <p>EU - €14.99 - €24.99</p><p>USA - $19.99 - $29.99</p><p>Australia - AU$29.99</p><p>Rest of World - £24.99</p></br>"
  },
  {
    "title": "Import duties & tax",
    "content": "</br><p>Orders shipping within the UK and EU include all applicable import fees and tax (wholesale orders excluded).</p></br><p>Orders to all other destinations do not include tax and may be subject to tax and duties on delivery. Tax rates are based on the rate of your country.</p></br>"
  },
  {
    "title": "PO Boxes",
    "content": "</br><p>We are unable to deliver to PO Boxes. Please enter a residential or commercial address when you place your order.</p></br>"
  },
  {
    "title": "Returns",
    "content": "</br><p>You have 14 days from the delivery date to request and dispatch a return. To send something back you can process the return automatically here: finecraft.returnscenter.com</p></br>"
  }
]
